class Patterns:
    B_NAME_PATTERN = r"""
    নাম:|নাম;|নাম,|নাম.|নামঃ
    """
    E_NAME_PATTERN = r"""
    (?i)name:|name;|name,|name.
    """
    F_NAME_PATTERN = r"""
    পিতা:|পিতা;|পিতা,|পিতা.|পিতাঃ|স্বামী:|স্বামী;|স্বামী,|স্বামী.|স্বামীঃ|স্বায়ী:|স্বায়ী;|স্বায়ী,|স্বায়ী.|স্বায়ীঃ|
    """
    M_NAME_PATTERN = r"""
    মাতা:|মাতা;|মাতা,|মাতা.|মাতাঃ
    """
    DOB_PATTERN = r"""
    (?i)date of birth:|date of birth;|date of birth,|date of birth.|date 0f birth:
    """
    NID_NO_PATTERN = r"""
    (?i)id no:|id no;id no,|id no.|ioNo|ioNo:|nioNo|nioNo:|NID No:|NID No.|NID No;|NID No,|NID No.|NID No:|NID No;|NID No,|NID No.|NID No:|NID No;|NID No,|NID No.|NID No:|NID No;|NID No,|NID No.|NID No:|NID No;|NID No,|NID No.|NID No:|NID No;|NID No,|NID No.|NID No:|NID No;|NID No,|NID No.|NID No:|NID No;|NID No,|NID No.|NID No:|NID No;|NID No,|NID No.|NID No:|NID No;|NID No,|NID No.|NiDNo
    """
    ADDRESS_PATTERN = r"""
    ঠিকানা:|ঠিকন|ঠিকনা,|ঠিকানা;|ঠিকানা,|ঠিকানা.|ঠিকানাঃ|ঠিকানা|টিকানা:|টিকানা;|টিকানা,|টিকানা.|টিকানাঃ|টিকানা|কানা:|কানা;|কানা,|কানা.|কানাঃ|কানা|হিকানু:|হিকানু
    """
    BLOOD_GROUP_PATTERN = r"[A|B|O|AB][+|-]"
    POB_PATTERN = r"""
    (?i)place of birth:|Place of birth:|Place of birth;|Place of birth,|Place of birth.|Place of birth:|Place of birth;|Place of birth,|Place of birth.|Place of birth:|Place of birth;|Place of birth,|Place of birth.|Place of birth:|Place of birth;|Place of birth,|Place of birth.|Place of birth:|Place of birth;|Place of birth,|Place of birth.|Place of birth:|Place of birth;|Place of birth,|Place of birth.|Place of birth:|Place of birth;|Place of birth,|Place of birth.|Place of birth:|Place of birth;|Place of birth,|Place of birth.|Place of birth:|Place of birth;|Place of birth,|Place of birth.|Place of birth:|Place of birth;|Place of birth,|Place of birth.
    """


class Languages:
    BENGALI = "ben"
    ENGLISH = "eng"


class Constant:
    POSTAL_DATA_JSON_PATH = 'postal_data.JSON'
    POST_CODE_JSON_PATH = 'postcodes.json'
    english_digits = {
        '0', '1', '2', '3', '4', '5', '6', '7', '8', '9'
    }
    english_alphabets = {
        'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q',
        'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h',
        'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y',
        'z'
    }
    english_characters = english_digits.union(english_alphabets)

    bengali_digits = {
        '০', '১', '২', '৩', '৪', '৫', '৬', '৭', '৮', '৯'
    }
    bengali_alphabets = {
        'অ', 'আ', 'ই', 'ঈ', 'উ', 'ঊ', 'ঋ', 'এ', 'ঐ', 'ও', 'ঔ', 'ক', 'খ', 'গ', 'ঘ', 'ঙ', 'চ', 'ছ', 'জ', 'ঝ', 'ঞ',
        'ট', 'ঠ', 'ড', 'ঢ', 'ণ', 'ত', 'থ', 'দ', 'ধ', 'ন', 'প', 'ফ', 'ব', 'ভ', 'ম', 'য', 'র', 'ল', 'শ', 'ষ', 'স', 'হ',
        'ড়', 'ঢ়', 'য়', 'ৎ', 'ং', 'ঃ', 'ঁ', 'া', 'ি', 'ী', 'ু', 'ূ', 'ৃ', 'ে', 'ৈ', 'ো', 'ৌ', '্', 'ৗ',
    }
    bengali_characters = bengali_digits.union(bengali_alphabets).union({' ', ',', ':'})

    districts = {
        'Dhaka': 'ঢাকা',
        'Faridpur': 'ফরিদপুর',
        'Gazipur': 'গাজীপুর',
        'Gopalganj': 'গোপালগঞ্জ',
        'Jamalpur': 'জামালপুর',
        'Kishoreganj': 'কিশোরগঞ্জ',
        'Madaripur': 'মাদারীপুর',
        'Manikganj': 'মানিকগঞ্জ',
        'Munshiganj': 'মুন্সিগঞ্জ',
        'Mymensingh': 'ময়মনসিংহ',
        'Narayanganj': 'নারায়ণগঞ্জ',
        'Narsingdi': 'নরসিংদী',
        'Netrokona': 'নেত্রকোণা',
        'Rajbari': 'রাজবাড়ী',
        'Shariatpur': 'শরীয়তপুর',
        'Sherpur': 'শেরপুর',
        'Tangail': 'টাঙ্গাইল',
        'Bogra': 'বগুড়া',
        'Joypurhat': 'জয়পুরহাট',
        'Naogaon': 'নওগাঁ',
        'Natore': 'নাটোর',
        'Nawabganj': 'নবাবগঞ্জ',
        'Pabna': 'পাবনা',
        'Rajshahi': 'রাজশাহী',
        'Sirajgonj': 'সিরাজগঞ্জ',
        'Dinajpur': 'দিনাজপুর',
        'Gaibandha': 'গাইবান্ধা',
        'Kurigram': 'কুড়িগ্রাম',
        'Lalmonirhat': 'লালমনিরহাট',
        'Nilphamari': 'নীলফামারী',
        'Panchagarh': 'পঞ্চগড়',
        'Rangpur': 'রংপুর',
        'Thakurgaon': 'ঠাকুরগাঁও',
        'Barguna': 'বরগুনা',
        'Barisal': 'বরিশাল',
        'Bhola': 'ভোলা',
        'Jhalokati': 'ঝালকাঠি',
        'Patuakhali': 'পটুয়াখালী',
        'Pirojpur': 'পিরোজপুর',
        'Bandarban': 'বান্দরবান',
        'Brahmanbaria': 'ব্রাহ্মণবাড়িয়া',
        'Chandpur': 'চাঁদপুর',
        'Chittagong': 'চট্টগ্রাম',
        'Comilla': 'কুমিল্লা',
        'Cumilla': 'কুমিল্লা',
        'Cox''s Bazar': 'কক্সবাজার',
        'Feni': 'ফেনী',
        'Khagrachari': 'খাগড়াছড়ি',
        'Lakshmipur': 'লক্ষ্মীপুর',
        'Noakhali': 'নোয়াখালী',
        'Rangamati': 'রাঙ্গামাটি',
        'Habiganj': 'হবিগঞ্জ',
        'Maulvibazar': 'মৌলভীবাজার',
        'Sunamganj': 'সুনামগঞ্জ',
        'Sylhet': 'সিলেট',
        'Bagerhat': 'বাগেরহাট',
        'Chuadanga': 'চুয়াডাঙ্গা',
        'Jessore': 'যশোর',
        'Jhenaidah': 'ঝিনাইদহ',
        'Khulna': 'খুলনা',
        'Kushtia': 'কুষ্টিয়া',
        'Magura': 'মাগুরা',
        'Meherpur': 'মেহেরপুর',
        'Narail': 'নড়াইল',
        'Satkhira': 'সাতক্ষীরা',
    }
    bengali_districts = list(districts.values())
    english_districts = list(districts.keys())

    upazillas = {
        'কুমিল্লা': ['দেবিদ্বার', 'বরুড়া', 'ব্রাহ্মণপাড়া', 'চান্দিনা', 'চৌদ্দগ্রাম', 'দাউদকান্দি', 'হোমনা', 'লাকসাম',
                     'মুরাদনগর', 'নাঙ্গলকোট', 'কুমিল্লা সদর', 'মেঘনা', 'মনোহরগঞ্জ', 'সদর দক্ষিণ', 'তিতাস', 'বুড়িচং',
                     'লালমাই'],
        'ফেনী': ['ছাগলনাইয়া', 'ফেনী সদর', 'সোনাগাজী', 'ফুলগাজী', 'পরশুরাম', 'দাগনভূঞা'],
        'ব্রাহ্মণবাড়িয়া': ['ব্রাহ্মণবাড়িয়া সদর', 'কসবা', 'নাসিরনগর', 'সরাইল', 'আশুগঞ্জ', 'আখাউড়া', 'নবীনগর',
                             'বাঞ্ছারামপুর', 'বিজয়নগর'],
        'রাঙ্গামাটি': ['রাঙ্গামাটি সদর', 'কাপ্তাই', 'কাউখালী', 'বাঘাইছড়ি', 'বরকল', 'লংগদু', 'রাজস্থলী', 'বিলাইছড়ি',
                       'জুরাছড়ি', 'নানিয়ারচর'],
        'নোয়াখালী': ['নোয়াখালী', 'কোম্পানীগঞ্জ', 'বেগমগঞ্জ', 'হাতিয়া', 'সুবর্ণচর', 'কবিরহাট', 'সেনবাগ', 'চাটখিল',
                      'সোনাইমুড়ী'],
        'চাঁদপুর': ['হাইমচর', 'কচুয়া', 'শাহরাস্তি', 'চাঁদপুর সদর', 'মতলব', 'হাজীগঞ্জ', 'মতলব', 'ফরিদগঞ্জ'],
        'লক্ষ্মীপুর': ['লক্ষ্মীপুর সদর', 'কমলনগর', 'রায়পুর', 'রামগতি', 'রামগঞ্জ'],
        'চট্টগ্রাম': ['রাঙ্গুনিয়া', 'সীতাকুন্ড', 'মীরসরাই', 'পটিয়া', 'সন্দ্বীপ', 'বাঁশখালী', 'বোয়ালখালী', 'আনোয়ারা',
                      'চন্দনাইশ', 'সাতকানিয়া', 'লোহাগাড়া', 'হাটহাজারী', 'ফটিকছড়ি', 'রাউজান', 'কর্ণফুলী'],
        'কক্সবাজার': ['কক্সবাজার সদর', 'চকরিয়া', 'কুতুবদিয়া', 'উখিয়া', 'মহেশখালী', 'পেকুয়া', 'রামু', 'টেকনাফ'],
        'খাগড়াছড়ি': ['খাগড়াছড়ি সদর', 'দিঘীনালা', 'পানছড়ি', 'লক্ষীছড়ি', 'মহালছড়ি', 'মানিকছড়ি', 'রামগড়',
                     'মাটিরাঙ্গা', 'গুইমারা'],
        'বান্দরবান': ['বান্দরবান সদর', 'আলীকদম', 'নাইক্ষ্যংছড়ি', 'রোয়াংছড়ি', 'লামা', 'রুমা', 'থানচি'],
        'সিরাজগঞ্জ': ['বেলকুচি', 'চৌহালি', 'কামারখন্দ', 'কাজীপুর', 'রায়গঞ্জ', 'শাহজাদপুর', 'সিরাজগঞ্জ', 'তাড়াশ',
                      'উল্লাপাড়া'],
        'পাবনা': ['সুজানগর', 'ঈশ্বরদী', 'ভাঙ্গুড়া', 'পাবনা সদর', 'বেড়া', 'আটঘরিয়া', 'চাটমোহর', 'সাঁথিয়া', 'ফরিদপুর'],
        'বগুড়া': ['কাহালু', 'বগুড়া সদর', 'সারিয়াকান্দি', 'শাজাহানপুর', 'দুপচাচিঁয়া', 'আদমদিঘি', 'নন্দিগ্রাম', 'সোনাতলা',
                  'ধুনট', 'গাবতলী', 'শেরপুর', 'শিবগঞ্জ'],
        'রাজশাহী': ['পবা', 'দুর্গাপুর', 'মোহনপুর', 'চারঘাট', 'পুঠিয়া', 'বাঘা', 'গোদাগাড়ী', 'তানোর', 'বাগমারা'],
        'নাটোর': ['নাটোর সদর', 'সিংড়া', 'বড়াইগ্রাম', 'বাগাতিপাড়া', 'লালপুর', 'গুরুদাসপুর', 'নলডাঙ্গা'],
        'জয়পুরহাট': ['আক্কেলপুর', 'কালাই', 'ক্ষেতলাল', 'পাঁচবিবি', 'জয়পুরহাট সদর'],
        'চাঁপাইনবাবগঞ্জ': ['চাঁপাইনবাবগঞ্জ সদর', 'গোমস্তাপুর', 'নাচোল', 'ভোলাহাট', 'শিবগঞ্জ'],
        'নওগাঁ': ['মহাদেবপুর', 'বদলগাছী', 'পত্নিতলা', 'ধামইরহাট', 'নিয়ামতপুর', 'মান্দা', 'আত্রাই', 'রাণীনগর',
                  'নওগাঁ সদর', 'পোরশা', 'সাপাহার'],
        'যশোর': ['মণিরামপুর', 'অভয়নগর', 'বাঘারপাড়া', 'চৌগাছা', 'ঝিকরগাছা', 'কেশবপুর', 'যশোর সদর', 'শার্শা'],
        'সাতক্ষীরা': ['আশাশুনি', 'দেবহাটা', 'কলারোয়া', 'সাতক্ষীরা সদর', 'শ্যামনগর', 'তালা', 'কালিগঞ্জ'],
        'মেহেরপুর': ['মুজিবনগর', 'মেহেরপুর সদর', 'গাংনী'],
        'নড়াইল': ['নড়াইল সদর', 'লোহাগড়া', 'কালিয়া'],
        'চুয়াডাঙ্গা': ['চুয়াডাঙ্গা সদর', 'আলমডাঙ্গা', 'দামুড়হুদা', 'জীবননগর'],
        'কুষ্টিয়া': ['কুষ্টিয়া সদর', 'কুমারখালী', 'খোকসা', 'মিরপুর', 'দৌলতপুর', 'ভেড়ামারা'],
        'মাগুরা': ['শালিখা', 'শ্রীপুর', 'মাগুরা সদর', 'মহম্মদপুর'],
        'খুলনা': ['পাইকগাছা', 'ফুলতলা', 'দিঘলিয়া', 'রূপসা', 'তেরখাদা', 'ডুমুরিয়া', 'বটিয়াঘাটা', 'দাকোপ', 'কয়রা'],
        'বাগেরহাট': ['ফকিরহাট', 'বাগেরহাট সদর', 'মোল্লাহাট', 'শরণখোলা', 'রামপাল', 'মোড়েলগঞ্জ', 'কচুয়া', 'মোংলা',
                     'চিতলমারী'],
        'ঝিনাইদহ': ['ঝিনাইদহ সদর', 'শৈলকুপা', 'হরিণাকুন্ডু', 'কালীগঞ্জ', 'কোটচাঁদপুর', 'মহেশপুর'],
        'ঝালকাঠি': ['ঝালকাঠি সদর', 'কাঠালিয়া', 'নলছিটি', 'রাজাপুর'],
        'পটুয়াখালী': ['বাউফল', 'পটুয়াখালী সদর', 'দুমকি', 'দশমিনা', 'কলাপাড়া', 'মির্জাগঞ্জ', 'গলাচিপা', 'রাঙ্গাবালী'],
        'পিরোজপুর': ['পিরোজপুর সদর', 'নাজিরপুর', 'কাউখালী', 'ভান্ডারিয়া', 'মঠবাড়ীয়া', 'নেছারাবাদ', 'ইন্দুরকানী'],
        'বরিশাল': ['বরিশাল সদর', 'বাকেরগঞ্জ', 'বাবুগঞ্জ', 'উজিরপুর', 'বানারীপাড়া', 'গৌরনদী', 'আগৈলঝাড়া', 'মেহেন্দিগঞ্জ',
                   'মুলাদী', 'হিজলা'],
        'ভোলা': ['ভোলা সদর', 'বোরহান উদ্দিন', 'চরফ্যাশন', 'দৌলতখান', 'মনপুরা', 'তজুমদ্দিন', 'লালমোহন'],
        'বরগুনা': ['আমতলী', 'বরগুনা সদর', 'বেতাগী', 'বামনা', 'পাথরঘাটা', 'তালতলি'],
        'সিলেট': ['বালাগঞ্জ', 'বিয়ানীবাজার', 'বিশ্বনাথ', 'কোম্পানীগঞ্জ', 'ফেঞ্চুগঞ্জ', 'গোলাপগঞ্জ', 'গোয়াইনঘাট',
                  'জৈন্তাপুর', 'কানাইঘাট', 'সিলেট সদর', 'জকিগঞ্জ', 'দক্ষিণ সুরমা', 'ওসমানী'],
        'মৌলভীবাজার': ['বড়লেখা', 'কমলগঞ্জ', 'কুলাউড়া', 'মৌলভীবাজার সদর', 'রাজনগর', 'শ্রীমঙ্গল', 'জুড়ী'],
        'হবিগঞ্জ': ['নবীগঞ্জ', 'বাহুবল', 'আজমিরীগঞ্জ', 'বানিয়াচং', 'লাখাই', 'চুনারুঘাট', 'হবিগঞ্জ সদর', 'মাধবপুর',
                    'শায়েস্তাগঞ্জ'],
        'সুনামগঞ্জ': ['সুনামগঞ্জ সদর', 'দক্ষিণ সুনামগঞ্জ', 'বিশ্বম্ভরপুর', 'ছাতক', 'জগন্নাথপুর', 'দোয়ারাবাজার',
                      'তাহিরপুর', 'ধর্মপাশা', 'জামালগঞ্জ', 'শাল্লা', 'দিরাই', 'মধ্যনগর'],
        'নরসিংদী': ['বেলাবো', 'মনোহরদী', 'নরসিংদী', 'পলাশ', 'রায়পুরা', 'শিবপুর'],
        'গাজীপুর': ['কালীগঞ্জ', 'কালিয়াকৈর', 'কাপাসিয়া', 'গাজীপুর সদর', 'শ্রীপুর'],
        'শরীয়তপুর': ['শরিয়তপুর সদর', 'নড়িয়া', 'জাজিরা', 'গোসাইরহাট', 'ভেদরগঞ্জ', 'ডামুড্যা'],
        'নারায়ণগঞ্জ': ['আড়াইহাজার', 'বন্দর', 'নারায়নগঞ্জ সদর', 'রূপগঞ্জ', 'সোনারগাঁ'],
        'টাঙ্গাইল': ['বাসাইল', 'ভুয়াপুর', 'দেলদুয়ার', 'ঘাটাইল', 'গোপালপুর', 'মধুপুর', 'মির্জাপুর', 'নাগরপুর',
                     'সখিপুর', 'টাঙ্গাইল সদর', 'কালিহাতী', 'ধনবাড়ী'],
        'কিশোরগঞ্জ': ['ইটনা', 'কটিয়াদী', 'ভৈরব', 'তাড়াইল', 'হোসেনপুর', 'পাকুন্দিয়া', 'কুলিয়ারচর', 'কিশোরগঞ্জ সদর',
                      'করিমগঞ্জ', 'বাজিতপুর', 'অষ্টগ্রাম', 'মিঠামইন', 'নিকলী'],
        'মানিকগঞ্জ': ['হরিরামপুর', 'সাটুরিয়া', 'মানিকগঞ্জ সদর', 'ঘিওর', 'শিবালয়', 'দৌলতপুর', 'সিংগাইর'],
        'ঢাকা': ['সাভার', 'ধামরাই', 'কেরাণীগঞ্জ', 'নবাবগঞ্জ', 'দোহার'],
        'মুন্সিগঞ্জ': ['মুন্সিগঞ্জ সদর', 'শ্রীনগর', 'সিরাজদিখান', 'লৌহজং', 'গজারিয়া', 'টংগীবাড়ি'],
        'রাজবাড়ী': ['রাজবাড়ী সদর', 'গোয়ালন্দ', 'পাংশা', 'বালিয়াকান্দি', 'কালুখালী'],
        'মাদারীপুর': ['মাদারীপুর সদর', 'শিবচর', 'কালকিনি', 'রাজৈর', 'ডাসার'],
        'গোপালগঞ্জ': ['গোপালগঞ্জ সদর', 'কাশিয়ানী', 'টুংগীপাড়া', 'কোটালীপাড়া', 'মুকসুদপুর'],
        'ফরিদপুর': ['ফরিদপুর সদর', 'আলফাডাঙ্গা', 'বোয়ালমারী', 'সদরপুর', 'নগরকান্দা', 'ভাঙ্গা', 'চরভদ্রাসন', 'মধুখালী',
                    'সালথা'],
        'পঞ্চগড়': ['পঞ্চগড়', 'দেবীগঞ্জ', 'বোদা', 'আটোয়ারী', 'তেতুলিয়া'],
        'দিনাজপুর': ['নবাবগঞ্জ', 'বীরগঞ্জ', 'ঘোড়াঘাট', 'বিরামপুর', 'পার্বতীপুর', 'বোচাগঞ্জ', 'কাহারোল', 'ফুলবাড়ী',
                     'দিনাজপুর সদর', 'হাকিমপুর', 'খানসামা', 'বিরল', 'চিরিরবন্দর'],
        'লালমনিরহাট': ['লালমনিরহাট সদর', 'কালীগঞ্জ', 'হাতীবান্ধা', 'পাটগ্রাম', 'আদিতমারী'],
        'নীলফামারী': ['সৈয়দপুর', 'ডোমার', 'ডিমলা', 'জলঢাকা', 'কিশোরগঞ্জ', 'নীলফামারী সদর'],
        'গাইবান্ধা': ['সাদুল্লাপুর', 'গাইবান্ধা সদর', 'পলাশবাড়ী', 'সাঘাটা', 'গোবিন্দগঞ্জ', 'সুন্দরগঞ্জ', 'ফুলছড়ি'],
        'ঠাকুরগাঁও': ['ঠাকুরগাঁও সদর', 'পীরগঞ্জ', 'রাণীশংকৈল', 'হরিপুর', 'বালিয়াডাঙ্গী'],
        'রংপুর': ['রংপুর সদর', 'গংগাচড়া', 'তারাগঞ্জ', 'বদরগঞ্জ', 'মিঠাপুকুর', 'পীরগঞ্জ', 'কাউনিয়া', 'পীরগাছা'],
        'কুড়িগ্রাম': ['কুড়িগ্রাম সদর', 'নাগেশ্বরী', 'ভুরুঙ্গামারী', 'ফুলবাড়ী', 'রাজারহাট', 'উলিপুর', 'চিলমারী',
                      'রৌমারী', 'চর রাজিবপুর'],
        'শেরপুর': ['শেরপুর সদর', 'নালিতাবাড়ী', 'শ্রীবরদী', 'নকলা', 'ঝিনাইগাতী'],
        'ময়মনসিংহ': ['ফুলবাড়ীয়া', 'ত্রিশাল', 'ভালুকা', 'মুক্তাগাছা', 'ময়মনসিংহ সদর', 'ধোবাউড়া', 'ফুলপুর', 'হালুয়াঘাট',
                     'গৌরীপুর', 'গফরগাঁও', 'ঈশ্বরগঞ্জ', 'নান্দাইল', 'তারাকান্দা'],
        'জামালপুর': ['জামালপুর সদর', 'মেলান্দহ', 'ইসলামপুর', 'দেওয়ানগঞ্জ', 'সরিষাবাড়ী', 'মাদারগঞ্জ', 'বকশীগঞ্জ'],
        'নেত্রকোণা': ['বারহাট্টা', 'দুর্গাপুর', 'কেন্দুয়া', 'আটপাড়া', 'মদন', 'খালিয়াজুরী', 'কলমাকান্দা', 'মোহনগঞ্জ',
                      'পূর্বধলা', 'নেত্রকোণা সদর'],
    }
    thanas = {
        # Barisal Division
        'বরগুনা': ['আমতলী', 'বরগুনা', 'বেতাগী', 'বামনা', 'পাথরঘাটা', 'তালতলি'],
        'বরিশাল': ['আগৈলঝাড়া', 'বাবুগঞ্জ', 'বাকেরগঞ্জ', 'বানারীপাড়া', 'গৌরনদী', 'হিজলা', 'বরিশাল সদর', 'মেহেন্দিগঞ্জ',
                   'মুলাদী', 'উজিরপুর'],
        'ভোলা': ['ভোলা', 'বোরহান', 'উদ্দিন', 'চরফ্যাশন', 'দৌলতখান', 'লালমোহন', 'মনপুরা', 'তজুমদ্দিন'],
        'ঝালকাঠি': ['ঝালকাঠি', 'কাঠালিয়া', 'নলছিটি', 'রাজাপুর'],
        'পটুয়াখালী': ['বাউফল', 'দশমিনা', 'দুমকি', 'গলাচিপা', 'কলাপাড়া', 'মির্জাগঞ্জ', 'পটুয়াখালী', 'রাঙ্গাবালী'],
        'পিরোজপুর': ['পিরোজপুর', 'নাজিরপুর', 'কাউখালী', 'ভান্ডারিয়া', 'মঠবাড়ীয়া', 'নেছারাবাদ', 'ইন্দুরকানী'],

        # Chittagong Division
        'বান্দরবান': ['আলীকদম', 'বান্দরবান', 'লামা', 'নাইক্ষ্যংছড়ি', 'রোয়াংছড়ি', 'রুমা', 'থানচি'],
        'ব্রাহ্মণবাড়িয়া': ['আখাউড়া', 'বাঞ্ছারামপুর', 'বিজয়নগর', 'ব্রাহ্মণবাড়িয়া', 'আশুগঞ্জ', 'কসবা', 'নবীনগর',
                             'নাসিরনগর', 'সরাইল'],
        'চাঁদপুর': ['চাঁদপুর', 'ফরিদগঞ্জ', 'হাইমচর', 'হাজীগঞ্জ', 'কচুয়া', 'মতলব উত্তর', 'মতলব দক্ষিণ', 'শাহরাস্তি'],
        'চট্টগ্রাম': ['আনোয়ারা', 'বায়েজিদ', 'বোস্তামী', 'বাঁশখালী', 'বাকলিয়া', 'বোয়ালখালী', 'চন্দনাইশ', 'চান্দগাঁও',
                      'বন্দর', 'ডবলমুরিং', 'ফটিকছড়ি', 'হালিশহর', 'হাটহাজারী', 'কোতোয়ালী', 'খুলশী', 'লোহাগাড়া',
                      'মীরসরাই', 'পাহাড়তলী', 'পাঁচলাইশ', 'পটিয়া', 'পতেঙ্গা', 'রাঙ্গুনিয়া', 'রাউজান', 'সন্দ্বীপ',
                      'সাতকানিয়া', 'সীতাকুন্ড'],
        'কুমিল্লা': ['বরুড়া', 'ব্রাহ্মণপাড়া', 'বুড়িচং', 'চান্দিনা', 'চৌদ্দগ্রাম', 'দাউদকান্দি', 'দেবিদ্বার', 'হোমনা',
                     'লাকসাম', 'মনোহরগঞ্জ', 'মেঘনা', 'মুরাদনগর', 'নাঙ্গলকোট', 'তিতাস', 'লালমাই'],
        'কক্সবাজার': ['কক্সবাজার', 'চকরিয়া', 'কুতুবদিয়া', 'উখিয়া', 'মহেশখালী', 'পেকুয়া', 'রামু', 'টেকনাফ'],
        'ফেনী': ['ছাগলনাইয়া', 'ফেনী সদর', 'সোনাগাজী', 'ফুলগাজী', 'পরশুরাম', 'দাগনভূঞা'],
        'খাগড়াছড়ি': ['খাগড়াছড়ি', 'দিঘীনালা', 'পানছড়ি', 'লক্ষীছড়ি', 'মহালছড়ি', 'মানিকছড়ি', 'রামগড়', 'মাটিরাঙ্গা',
                     'গুইমারা'],
        'লক্ষ্মীপুর': ['লক্ষ্মীপুর সদর', 'কমলনগর', 'রায়পুর', 'রামগতি', 'রামগঞ্জ'],
        'নোয়াখালী': ['নোয়াখালী', 'কোম্পানীগঞ্জ', 'বেগমগঞ্জ', 'হাতিয়া', 'সুবর্ণচর', 'কবিরহাট', 'সেনবাগ', 'চাটখিল',
                      'সোনাইমুড়ী'],
        'রাঙ্গামাটি': ['রাঙ্গামাটি সদর', 'কাপ্তাই', 'কাউখালী', 'বাঘাইছড়ি', 'বরকল', 'লংগদু', 'রাজস্থলী', 'বিলাইছড়ি',
                       'জুরাছড়ি', 'নানিয়ারচর'],

        # Dhaka Division
        'ঢাকা': ['আদাবর', 'বাড্ডা', 'বংশাল', 'বিমানবন্দর', 'বনানী', 'ঢাকা সেনানিবাস', 'চকবাজার', 'দক্ষিণখান',
                 'দারুসসালাম', 'ডেমরা', 'ধামরাই', 'ধানমন্ডি', 'দোহার', 'ভাষানটেক', 'ভাটারা', 'গেন্ডারিয়া', 'গুলশান',
                 'হাজারীবাগ', 'যাত্রাবাড়ী', 'কাফরুল', 'কদমতলী', 'কলাবাগান', 'কামরাঙ্গীরচর', 'খিলগাঁও', 'খিলক্ষেত',
                 'কেরাণীগঞ্জ', 'কোতোয়ালী', 'লালবাগ', 'মিরপুর', 'মোহাম্মদপুর', 'মতিঝিল', 'মুগদা', 'নবাবগঞ্জ',
                 'নিউমার্কেট', 'পল্লবী', 'পল্টন', 'রমনা', 'রামপুরা', 'সবুজবাগ ', 'রূপনগর', 'সাভার', 'শাহজাহানপুর',
                 'শাহআলী', 'শাহবাগ', 'শ্যামপুর', 'শেরেবাংলা নগর', 'সূত্রাপুর', 'তেজগাঁও', 'তেজগাঁও শিল্প এলাকা',
                 'তুরাগ', 'উত্তরা পশ্চিম', 'উত্তরা পূর্ব', 'উত্তরখান', 'ওয়ারী'],
        'ফরিদপুর': ['ফরিদপুর', 'আলফাডাঙ্গা', 'বোয়ালমারী', 'সদরপুর', 'নগরকান্দা', 'ভাঙ্গা', 'চরভদ্রাসন', 'মধুখালী',
                    'সালথা'],
        'গাজীপুর': ['কালীগঞ্জ', 'কালিয়াকৈর', 'কাপাসিয়া', 'গাজীপুর', 'শ্রীপুর'],
        'গোপালগঞ্জ': ['গোপালগঞ্জ', 'কাশিয়ানী', 'টুংগীপাড়া', 'কোটালীপাড়া', 'মুকসুদপুর'],
        'জামালপুর': ['জামালপুর', 'মেলান্দহ', 'ইসলামপুর', 'দেওয়ানগঞ্জ', 'সরিষাবাড়ী', 'মাদারগঞ্জ', 'বকশীগঞ্জ'],
        'কিশোরগঞ্জ': ['ইটনা', 'কটিয়াদী', 'ভৈরব', 'তাড়াইল', 'হোসেনপুর', 'পাকুন্দিয়া', 'কুলিয়ারচর', 'কিশোরগঞ্জ',
                      'করিমগঞ্জ', 'বাজিতপুর', 'অষ্টগ্রাম', 'মিঠামইন', 'নিকলী'],
        'মাদারীপুর': ['মাদারীপুর', 'শিবচর', 'কালকিনি', 'রাজৈর', 'ডাসার'],
        'মানিকগঞ্জ': ['হরিরামপুর', 'সাটুরিয়া', 'মানিকগঞ্জ', 'ঘিওর', 'শিবালয়', 'দৌলতপুর', 'সিংগাইর'],
        'মুন্সিগঞ্জ': ['মুন্সিগঞ্জ', 'শ্রীনগর', 'সিরাজদিখান', 'লৌহজং', 'গজারিয়া', 'টংগীবাড়ি'],
        'ময়মনসিংহ': ['ফুলবাড়ীয়া', 'ত্রিশাল', 'ভালুকা', 'মুক্তাগাছা', 'ময়মনসিংহ', 'ধোবাউড়া', 'ফুলপুর', 'হালুয়াঘাট',
                     'গৌরীপুর', 'গফরগাঁও', 'ঈশ্বরগঞ্জ', 'নান্দাইল', 'তারাকান্দা'],
        'নারায়ণগঞ্জ': ['আড়াইহাজার', 'বন্দর', 'নারায়নগঞ্জ', 'রূপগঞ্জ', 'সোনারগাঁ'],
        'নরসিংদী': ['বেলাবো', 'মনোহরদী', 'নরসিংদী', 'পলাশ', 'রায়পুরা', 'শিবপুর'],
        'নেত্রকোণা': ['বারহাট্টা', 'দুর্গাপুর', 'কেন্দুয়া', 'আটপাড়া', 'মদন', 'খালিয়াজুরী', 'কলমাকান্দা', 'মোহনগঞ্জ',
                      'পূর্বধলা', 'নেত্রকোণা'],
        'রাজবাড়ী': ['রাজবাড়ী', 'গোয়ালন্দ', 'পাংশা', 'বালিয়াকান্দি', 'কালুখালী'],
        'শরীয়তপুর': ['শরিয়তপুর', 'নড়িয়া', 'জাজিরা', 'গোসাইরহাট', 'ভেদরগঞ্জ', 'ডামুড্যা'],
        'শেরপুর': ['শেরপুর', 'নালিতাবাড়ী', 'শ্রীবরদী', 'নকলা', 'ঝিনাইগাতী'],
        'টাঙ্গাইল': ['বাসাইল', 'ভুয়াপুর', 'দেলদুয়ার', 'ঘাটাইল', 'গোপালপুর', 'মধুপুর', 'মির্জাপুর', 'নাগরপুর',
                     'সখিপুর', 'টাঙ্গাইল', 'কালিহাতী', 'ধনবাড়ী'],

        # Khulna Division
        'বাগেরহাট': ['ফকিরহাট', 'বাগেরহাট', 'মোল্লাহাট', 'শরণখোলা', 'রামপাল', 'মোড়েলগঞ্জ', 'কচুয়া', 'মোংলা',
                     'চিতলমারী'],
        'চুয়াডাঙ্গা': ['চুয়াডাঙ্গা', 'আলমডাঙ্গা', 'দামুড়হুদা', 'জীবননগর'],
        'যশোর': ['মণিরামপুর', 'অভয়নগর', 'বাঘারপাড়া', 'চৌগাছা', 'ঝিকরগাছা', 'কেশবপুর', 'যশোর', 'শার্শা'],
        'ঝিনাইদহ': ['ঝিনাইদহ', 'শৈলকুপা', 'হরিণাকুন্ডু', 'কালীগঞ্জ', 'কোটচাঁদপুর', 'মহেশপুর'],
        'খুলনা': ['পাইকগাছা', 'ফুলতলা', 'দিঘলিয়া', 'রূপসা', 'তেরখাদা', 'ডুমুরিয়া', 'বটিয়াঘাটা', 'দাকোপ', 'কয়রা'],
        'কুষ্টিয়া': ['কুষ্টিয়া', 'কুমারখালী', 'খোকসা', 'মিরপুর', 'দৌলতপুর', 'ভেড়ামারা'],
        'মাগুরা': ['শালিখা', 'শ্রীপুর', 'মাগুরা', 'মহম্মদপুর'],
        'মেহেরপুর': ['মুজিবনগর', 'মেহেরপুর', 'গাংনী'],
        'নড়াইল': ['নড়াইল', 'লোহাগড়া', 'কালিয়া'],
        'সাতক্ষীরা': ['আশাশুনি', 'দেবহাটা', 'কলারোয়া', 'সাতক্ষীরা', 'শ্যামনগর', 'তালা', 'কালিগঞ্জ'],

        # Rajshahi Division
        'বগুড়া': ['কাহালু', 'বগুড়া', 'সারিয়াকান্দি', 'শাজাহানপুর', 'দুপচাচিঁয়া', 'আদমদিঘি', 'নন্দিগ্রাম', 'সোনাতলা',
                  'ধুনট', 'গাবতলী', 'শেরপুর', 'শিবগঞ্জ'],
        'চাঁপাইনবাবগঞ্জ': ['চাঁপাইনবাবগঞ্জ', 'গোমস্তাপুর', 'নাচোল', 'ভোলাহাট', 'শিবগঞ্জ'],
        'জয়পুরহাট': ['আক্কেলপুর', 'কালাই', 'ক্ষেতলাল', 'পাঁচবিবি', 'জয়পুরহাট'],
        'নওগাঁ': ['মহাদেবপুর', 'বদলগাছী', 'পত্নিতলা', 'ধামইরহাট', 'নিয়ামতপুর', 'মান্দা', 'আত্রাই', 'রাণীনগর', 'নওগাঁ',
                  'পোরশা', 'সাপাহার'],
        'নাটোর': ['নাটোর', 'সিংড়া', 'বড়াইগ্রাম', 'বাগাতিপাড়া', 'লালপুর', 'গুরুদাসপুর', 'নলডাঙ্গা'],
        'পাবনা': ['সুজানগর', 'ঈশ্বরদী', 'ভাঙ্গুড়া', 'পাবনা', 'বেড়া', 'আটঘরিয়া', 'চাটমোহর', 'সাঁথিয়া', 'ফরিদপুর'],
        'রাজশাহী': ['পবা', 'দুর্গাপুর', 'মোহনপুর', 'চারঘাট', 'পুঠিয়া', 'বাঘা', 'গোদাগাড়ী', 'তানোর', 'বাগমারা'],
        'সিরাজগঞ্জ': ['বেলকুচি', 'চৌহালি', 'কামারখন্দ', 'কাজীপুর', 'রায়গঞ্জ', 'শাহজাদপুর', 'সিরাজগঞ্জ', 'তাড়াশ',
                      'উল্লাপাড়া'],

        # Rangpur Division
        'দিনাজপুর': ['নবাবগঞ্জ', 'বীরগঞ্জ', 'ঘোড়াঘাট', 'বিরামপুর', 'পার্বতীপুর', 'বোচাগঞ্জ', 'কাহারোল', 'ফুলবাড়ী',
                     'দিনাজপুর', 'হাকিমপুর', 'খানসামা', 'বিরল', 'চিরিরবন্দর'],
        'গাইবান্ধা': ['সাদুল্লাপুর', 'গাইবান্ধা', 'পলাশবাড়ী', 'সাঘাটা', 'গোবিন্দগঞ্জ', 'সুন্দরগঞ্জ', 'ফুলছড়ি'],
        'কুড়িগ্রাম': ['কুড়িগ্রাম', 'নাগেশ্বরী', 'ভুরুঙ্গামারী', 'ফুলবাড়ী', 'রাজারহাট', 'উলিপুর', 'চিলমারী', 'রৌমারী',
                      'চর রাজিবপুর'],
        'লালমনিরহাট': ['আদিতমারী', 'হাতীবান্ধা', 'কালীগঞ্জ', 'লালমনিরহাট', 'পাটগ্রাম'],
        'নীলফামারী': ['ডিমলা', 'ডোমার', 'জলঢাকা', 'কিশোরগঞ্জ', 'নীলফামারী', 'সৈয়দপুর'],
        'পঞ্চগড়': ['আটোয়ারী', 'বোদা', 'দেবীগঞ্জ', 'পঞ্চগড়', 'তেতুলিয়া'],
        'রংপুর': ['বদরগঞ্জ', 'গংগাচড়া', 'কাউনিয়া', 'রংপুর', 'মিঠাপুকুর', 'পীরগাছা', 'পীরগঞ্জ', 'তারাগঞ্জ'],
        'ঠাকুরগাঁও': ['বালিয়াডাঙ্গী', 'হরিপুর', 'পীরগঞ্জ', 'রাণীশংকৈল', 'ঠাকুরগাঁও'],

        # Sylhet Division
        'হবিগঞ্জ': ['আজমিরীগঞ্জ', 'বাহুবল', 'বানিয়াচং', 'চুনারুঘাট', 'হবিগঞ্জ', 'লাখাই', 'মাধবপুর', 'নবীগঞ্জ',
                    'শায়েস্তাগঞ্জ'],
        'মৌলভীবাজার': ['বড়লেখা', 'জুড়ী', 'কমলগঞ্জ', 'কুলাউড়া', 'মৌলভীবাজার', 'রাজনগর', 'শ্রীমঙ্গল'],
        'সুনামগঞ্জ': ['বিশ্বম্ভরপুর', 'ছাতক', 'দক্ষিণ সুনামগঞ্জ', 'দিরাই', 'ধর্মপাশা', 'দোয়ারাবাজার', 'জগন্নাথপুর',
                      'জামালগঞ্জ', 'শাল্লা', 'সুনামগঞ্জ', 'তাহিরপুর', 'মধ্যনগর'],
        'সিলেট': ['বালাগঞ্জ', 'বিয়ানীবাজার', 'বিশ্বনাথ', 'কোম্পানীগঞ্জ', 'দক্ষিণ সুরমা', 'ফেঞ্চুগঞ্জ', 'গোলাপগঞ্জ',
                  'গোয়াইনঘাট', 'জৈন্তাপুর', 'কানাইঘাট', 'সিলেট', 'জকিগঞ্জ', 'ওসমানী'],
    }

